mummyJane/boardmanager/project/apps/stm32_nucleo_io_demo/main/stm32f4xx_hal_conf.h
#ifndef STM32F4XX_HAL_CONF_H
#define STM32F4XX_HAL_CONF_H

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

#define HSI_VALUE 16000000U
#define HSE_VALUE 8000000U
#define LSI_VALUE 32000U
#define LSE_VALUE 32768U
#define EXTERNAL_CLOCK_VALUE 12288000U

#define HSE_STARTUP_TIMEOUT 100U
#define LSE_STARTUP_TIMEOUT 5000U

#define VDD_VALUE 3300U
#define TICK_INT_PRIORITY 0x0FU
#define PREFETCH_ENABLE 1U
#define INSTRUCTION_CACHE_ENABLE 1U
#define DATA_CACHE_ENABLE 1U
#define USE_RTOS 0U
#define USE_HAL_ASSERT 0U

#define assert_param(expr) ((void)0U)

#include "stm32f4xx_hal_rcc.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_cortex.h"
#include "stm32f4xx_hal_flash.h"
#include "stm32f4xx_hal_pwr.h"

#endif
